In [55]:
from sqlalchemy import create_engine, text
from sqlalchemy.orm import sessionmaker
from sqlalchemy.engine.base import Engine
import pandas as pd


# データベースへの接続設定
DATABASE_URI = 'mysql+mysqlconnector://root:password@localhost/lesson'
engine = create_engine(DATABASE_URI)

def execute_query_to_dataframe(query: str, engine: Engine) -> pd.DataFrame:
    with engine.connect() as conn:
        df = pd.read_sql_query(text(query), conn)
        return df

In [2]:
q = 'select * from books'
execute_query_to_dataframe(q, engine)

  book_id              title cat_id        author        date  price  stock
0   B1001      たのしく学ぶSQLコマンド    C01          鈴木正男  2001-05-03   1800  120.0
1   B1002          はじめてのDB設計    C01          鈴木正子  2001-10-21   2000   88.0
2   B1003       ウォーキングをはじめよう    C05          高橋孝子  2002-09-05    980   15.0
3   B1004         ネットワーク構築入門    C01          山田和夫  2004-08-04   2200   56.0
4   B1005       成功する人の108の習慣    C02          高橋太郎  2008-03-03   1500    2.0
5   B1006            おてがるレシピ    C05          佐藤茂夫  2012-04-11    880   66.0
6   B1007    みきむら先生の基本情報技術教本    C03          三木村健  2016-08-24   1800   32.0
7   B1008  Computer Networks    C01  Robert Smith  2018-05-05   2100   25.0
8   B1009       SQL Handbook    C01      John Doe  2021-12-01   2600   43.0
9   B1010         風景画を描いてみよう   None          田中十郎        None   1500    NaN

In [3]:
q = '''
select book_id, title
from books
where date is null
'''

execute_query_to_dataframe(q, engine)

  book_id       title
0   B1010  風景画を描いてみよう

In [4]:
# 7
q = '''
select count(distinct cat_id) as 重複しないカテゴリID数
from books
'''

execute_query_to_dataframe(q, engine)

   重複しないカテゴリID数
0             4

In [10]:
# 8 CASTは研修でやらなかったな。
query = '''
SELECT 
    cat_id AS カテゴリID,
    CAST(SUM(stock) AS SIGNED INTEGER) AS 在庫合計
FROM
    books
GROUP BY 
    cat_id
HAVING
    SUM(stock) >= 50
'''

execute_query_to_dataframe(query, engine)

  カテゴリID  在庫合計
0    C01   332
1    C05    81

In [1]:
print(f"#1 {10*0.6+70*(1-0.6)}")
print(f"#2 {10*0.7+70*(1-0.7)}")
print(f"#3 {20*0.7+50*(1-0.7)}")
print(f"#4 {20*0.8+50*(1-0.8)}")

#1 34.0
#2 28.000000000000004
#3 29.0
#4 26.0

In [2]:
import numpy as np

# A君とB君の成績データ
# 数学と国語の得点
grades_A = np.array([40, 60])  # A君の数学、国語の得点
grades_B = np.array([60, 40])  # B君の数学、国語の得点

# 成績データを行列としてまとめる（各行が一つの科目を表し、列が各生徒の得点を表す）
grades = np.array([grades_A, grades_B]).T  # .T で転置し、列が生徒、行が科目になるようにする
print(grades)
# NumPyのcorrcoef関数を用いて相関係数行列を計算
correlation_matrix = np.corrcoef(grades, rowvar=False)
print(f"相関係数行列\n{correlation_matrix}")

# 相関係数行列から、数学と国語の相関係数を取得
correlation_coefficient = correlation_matrix[0, 1]

correlation_coefficient

[[40 60]
 [60 40]]
相関係数行列
[[ 1. -1.]
 [-1.  1.]]

-0.9999999999999999

In [4]:
import numpy as np

arr = np.array([[0, 1], [2, 3]]) 
arr = arr.reshape(-1, 1)
arr

array([[0],
       [1],
       [2],
       [3]])

In [11]:
# 9 
query = '''
SELECT title, date
FROM books
WHERE date NOT BETWEEN '2004-01-01' AND '2018-12-31'
'''

execute_query_to_dataframe(query, engine)

           title        date
0  たのしく学ぶSQLコマンド  2001-05-03
1      はじめてのDB設計  2001-10-21
2   ウォーキングをはじめよう  2002-09-05
3   SQL Handbook  2021-12-01

[x]TODO NOT BETWEENを確認する

In [8]:
# メモリのアクセス時間の計算
print(f"1 {10*0.6 + 70*(1-0.6)}")
print(f"2 {10*0.7 + 70*(1-0.7)}")
print(f"3 {20*0.7 + 50*(1-0.7)}")
print(f"4 {20*0.8 + 50*(1-0.8)}")

1 34.0
2 28.000000000000004
3 29.0
4 26.0

## 変更前：複合キーを使用したユーザーテーブル

| 姓 | 名 | 生年月日 | 電話番号 | 住所 | メールアドレス |
|----|----|---------:|----------|------|----------------|
| 山田 | 太郎 | 1990-05-15 | 090-1234-5678 | 東京都新宿区... | taro@example.com |
| 鈴木 | 花子 | 1985-11-23 | 080-8765-4321 | 大阪府大阪市... | hanako@example.com |

主キー: (姓, 名, 生年月日, 電話番号)の組み合わせ

## 変更後：Surrogate Key（代理キー）を使用したユーザーテーブル

| ユーザーID | 姓 | 名 | 生年月日 | 電話番号 | 住所 | メールアドレス |
|----------:|----|----|---------:|----------|------|----------------|
| 1 | 山田 | 太郎 | 1990-05-15 | 090-1234-5678 | 東京都新宿区... | taro@example.com |
| 2 | 鈴木 | 花子 | 1985-11-23 | 080-8765-4321 | 大阪府大阪市... | hanako@example.com |

主キー: ユーザーID
ユニーク制約: (姓, 名, 生年月日, 電話番号)の組み合わせ

In [10]:
q = '''
select title, date
from books
where date not between '2004-01-01' and '2018-12-31' 
'''

execute_query_to_dataframe(q, engine)

OperationalError: (mysql.connector.errors.OperationalError) MySQL Connection not available.
[SQL:
select title, date
from books
where date not between '2004-01-01' and '2018-12-31'
]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [2]:
df = execute_query_to_dataframe('select * from books', engine)
df.head()

  book_id          title cat_id author        date  price  stock
0   B1001  たのしく学ぶSQLコマンド    C01   鈴木正男  2001-05-03   1800  120.0
1   B1002      はじめてのDB設計    C01   鈴木正子  2001-10-21   2000   88.0
2   B1003   ウォーキングをはじめよう    C05   高橋孝子  2002-09-05    980   15.0
3   B1004     ネットワーク構築入門    C01   山田和夫  2004-08-04   2200   56.0
4   B1005   成功する人の108の習慣    C02   高橋太郎  2008-03-03   1500    2.0

In [3]:
# 10
q = '''
select book_id, title, price * stock as 在庫価格
from books

'''
execute_query_to_dataframe(q, engine)

  book_id              title      在庫価格
0   B1001      たのしく学ぶSQLコマンド  216000.0
1   B1002          はじめてのDB設計  176000.0
2   B1003       ウォーキングをはじめよう   14700.0
3   B1004         ネットワーク構築入門  123200.0
4   B1005       成功する人の108の習慣    3000.0
5   B1006            おてがるレシピ   58080.0
6   B1007    みきむら先生の基本情報技術教本   57600.0
7   B1008  Computer Networks   52500.0
8   B1009       SQL Handbook  111800.0
9   B1010         風景画を描いてみよう       NaN

In [10]:
q = '''
SELECT cat_id AS カテゴリID, ROUND(AVG(price), 0) AS 平均価格
FROM books
GROUP BY cat_id 
HAVING cat_id IS NOT NULL
'''

execute_query_to_dataframe(q, engine)

  カテゴリID    平均価格
0    C01  2140.0
1    C05   930.0
2    C02  1500.0
3    C03  1800.0

In [11]:
q ='SELECT * FROM books'
df = execute_query_to_dataframe(q, engine)
df.head()

  book_id          title cat_id author        date  price  stock
0   B1001  たのしく学ぶSQLコマンド    C01   鈴木正男  2001-05-03   1800  120.0
1   B1002      はじめてのDB設計    C01   鈴木正子  2001-10-21   2000   88.0
2   B1003   ウォーキングをはじめよう    C05   高橋孝子  2002-09-05    980   15.0
3   B1004     ネットワーク構築入門    C01   山田和夫  2004-08-04   2200   56.0
4   B1005   成功する人の108の習慣    C02   高橋太郎  2008-03-03   1500    2.0

In [13]:
# 12 文字列の結合はCONCAT
q = '''
SELECT CONCAT(title, 'の著者は', author) AS 書籍紹介
FROM books
'''
execute_query_to_dataframe(q, engine)

                                書籍紹介
0              たのしく学ぶSQLコマンドの著者は鈴木正男
1                  はじめてのDB設計の著者は鈴木正子
2               ウォーキングをはじめようの著者は高橋孝子
3                 ネットワーク構築入門の著者は山田和夫
4               成功する人の108の習慣の著者は高橋太郎
5                    おてがるレシピの著者は佐藤茂夫
6            みきむら先生の基本情報技術教本の著者は三木村健
7  Computer Networksの著者はRobert Smith
8           SQL Handbookの著者はJohn Doe
9                 風景画を描いてみようの著者は田中十郎

In [18]:
q = '''
SELECT title AS 書籍名, author AS 著者名, COALESCE(stock, 0) AS 在庫
FROM books
WHERE price = '1500'
'''

execute_query_to_dataframe(q, engine)

            書籍名   著者名  在庫
0  成功する人の108の習慣  高橋太郎   2
1    風景画を描いてみよう  田中十郎   0

In [19]:
# 0.6N = 0.8(n-8) = 0.6n = 0.8n - 6.4
64 / 2

32.0

# 二章演習問題(オプション)

In [20]:
q = 'SELECT * FROM books'
execute_query_to_dataframe(q, engine)

  book_id              title cat_id        author        date  price  stock
0   B1001      たのしく学ぶSQLコマンド    C01          鈴木正男  2001-05-03   1800  120.0
1   B1002          はじめてのDB設計    C01          鈴木正子  2001-10-21   2000   88.0
2   B1003       ウォーキングをはじめよう    C05          高橋孝子  2002-09-05    980   15.0
3   B1004         ネットワーク構築入門    C01          山田和夫  2004-08-04   2200   56.0
4   B1005       成功する人の108の習慣    C02          高橋太郎  2008-03-03   1500    2.0
5   B1006            おてがるレシピ    C05          佐藤茂夫  2012-04-11    880   66.0
6   B1007    みきむら先生の基本情報技術教本    C03          三木村健  2016-08-24   1800   32.0
7   B1008  Computer Networks    C01  Robert Smith  2018-05-05   2100   25.0
8   B1009       SQL Handbook    C01      John Doe  2021-12-01   2600   43.0
9   B1010         風景画を描いてみよう   None          田中十郎        None   1500    NaN

In [21]:
query = '''
SELECT book_id AS 書籍ID, title AS 書籍名, COALESCE(stock, 0)*price AS 在庫金額
FROM books
'''

execute_query_to_dataframe(query, engine)

    書籍ID                書籍名    在庫金額
0  B1001      たのしく学ぶSQLコマンド  216000
1  B1002          はじめてのDB設計  176000
2  B1003       ウォーキングをはじめよう   14700
3  B1004         ネットワーク構築入門  123200
4  B1005       成功する人の108の習慣    3000
5  B1006            おてがるレシピ   58080
6  B1007    みきむら先生の基本情報技術教本   57600
7  B1008  Computer Networks   52500
8  B1009       SQL Handbook  111800
9  B1010         風景画を描いてみよう       0

In [26]:
# 2
query = '''
SELECT title, price
FROM books
WHERE price = (SELECT MIN(price) FROM books)
'''
execute_query_to_dataframe(query, engine)

     title  price
0  おてがるレシピ    880

In [27]:
# 実行できるクエリ
q = '''
SELECT MIN(price)
FROM books
'''
execute_query_to_dataframe(q, engine)

   MIN(price)
0         880

はい、この疑問はとても良い質問です。SQLの動作と集計関数の使い方について深く理解するのに役立ちます。それぞれのクエリについて、小学生にも分かるように説明していきましょう。

1. 実行できるクエリ:
```sql
SELECT MIN(price)
FROM books
```
このクエリが実行できる理由：
- このクエリは、本の価格の中で一番安い値段を探しています。
- テーブル全体から1つの値（最小値）を求めているので、問題ありません。
- 図書館で「一番薄い本は何ページですか？」と聞くようなものです。

2. 実行できないクエリ:
```sql
SELECT title, MIN(price)
FROM books
```
このクエリが実行できない理由：
- このクエリは2つのことを同時に求めようとしています：
  1. 本のタイトル（title）
  2. 一番安い本の価格（MIN(price)）
- 問題は、「どの本のタイトルを表示すればいいの？」ということです。
- 一番安い本の価格は1つの値ですが、タイトルは複数あります。
- これは「図書館の本のタイトルと、一番薄い本のページ数を教えて」と聞くようなものです。どの本のタイトルを答えればいいのかわかりません。

なぜ副問い合わせが必要か：
1. 段階的に情報を絞り込むため：
   - まず、一番安い本の価格を見つけます。
   - 次に、その価格と同じ本を探します。

2. 条件を明確にするため：
   - 「一番安い本」という条件を明確に指定できます。

3. SQLの制約を守るため：
   - SQLでは、集計関数（MIN, MAX, AVGなど）と非集計カラム（title）を同時に使う場合、GROUP BY句が必要です。
   - しかし、この場合はGROUP BYを使うと意図した結果が得られません。

正しいクエリ（副問い合わせを使用）：
```sql
SELECT title, price
FROM books
WHERE price = (SELECT MIN(price) FROM books)
```

このクエリの動作：
1. まず、`(SELECT MIN(price) FROM books)` で一番安い本の価格を見つけます。
2. 次に、その価格と同じ価格の本のタイトルと価格を選びます。

このように、副問い合わせを使うことで、「一番安い本」という条件を明確に指定し、その条件に合う本のタイトルと価格を取得することができます。

副問い合わせは、複雑な条件を段階的に適用する時に非常に役立つ技術です。練習を重ねることで、より理解が深まっていくでしょう。

In [30]:
# 3
q = '''
SELECT titile, cat_id
FROM books
WHERE price = (SELECT price FROM books WHERE price >= 1600)

'''
execute_query_to_dataframe(q, engine)

ProgrammingError: (mysql.connector.errors.ProgrammingError) 1054 (42S22): Unknown column 'titile' in 'field list'
[SQL:
SELECT titile, cat_id
FROM books
WHERE price = (SELECT price FROM books WHERE price >= 1600)

]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [37]:
# 精度と再現率を計算する関数
def calculate_metrics(relevant_results, retrieved_results, all_relevant):
    precision = len(relevant_results) / len(retrieved_results) if retrieved_results else 0
    recall = len(relevant_results) / len(all_relevant) if all_relevant else 0
    return precision, recall

# 検索クエリの例
search_term = 'SQL'

try:
    with engine.connect() as conn:
        # 関連するすべての本（タイトルに'SQL'を含む本と仮定）
        all_relevant = conn.execute(text("SELECT book_id FROM books WHERE title LIKE :term"), 
                                    {'term': f'%{search_term}%'}).fetchall()
        
        # 検索された本（より複雑なクエリを使用）
        retrieved = conn.execute(text("""
            SELECT book_id FROM books 
            WHERE title LIKE :term OR author LIKE :term OR cat_id = 'C01'
        """), {'term': f'%{search_term}%'}).fetchall()
        
        # 検索結果中の関連する本
        relevant_retrieved = [book for book in retrieved if book in all_relevant]

        # 精度と再現率を計算
        precision, recall = calculate_metrics(relevant_retrieved, retrieved, all_relevant)

        print(f"検索語: {search_term}")
        print(f"精度 (Precision): {precision:.2f}")
        print(f"再現率 (Recall): {recall:.2f}")

        # 結果の詳細を表示
        print(f"\n全ての関連書籍数: {len(all_relevant)}")
        print(f"検索された書籍数: {len(retrieved)}")
        print(f"検索結果中の関連書籍数: {len(relevant_retrieved)}")

        # 検索結果の書籍タイトルを表示
        print("\n検索された書籍:")
        
        # book_idのリストを作成
        book_ids = [book.book_id for book in retrieved]
        
        # IN句を使用するクエリを作成
        query = text("SELECT title FROM books WHERE book_id IN :ids")
        
        # クエリを実行し結果を取得
        book_titles = conn.execute(query, {'ids': book_ids}).fetchall()

        for title in book_titles:
            print(f"- {title[0]}")

except Exception as e:
    print(f"エラーが発生しました: {e}")

検索語: SQL
精度 (Precision): 0.40
再現率 (Recall): 1.00

全ての関連書籍数: 2
検索された書籍数: 5
検索結果中の関連書籍数: 2

検索された書籍:
エラーが発生しました: Python type list cannot be converted

In [38]:
try:
    # データベースに接続
    with engine.connect() as connection:
        # 'SHOW DATABASES' クエリを実行
        result = connection.execute(text("SHOW DATABASES"))
        
        # 結果を取得し出力
        print("MySQL データベース一覧:")
        for row in result:
            print(f"- {row[0]}")

except Exception as e:
    print(f"エラーが発生しました: {e}")

finally:
    # エンジンを破棄（接続プールをクリーンアップ）
    engine.dispose()

MySQL データベース一覧:
- information_schema
- lesson
- mysql
- performance_schema
- sys

In [41]:
# キャッシュメモリの計算
no1_ans = 10 * 0.6 + 70 * (1-0.6)
print(f"no1. {no1_ans}")
no2_ans = 10 * 0.7 + 70 * (1-0.7)
print(f"no2. {no2_ans}")
no3_ans = 20 * 0.7 + 50 * (1-0.7)
print(f"no3. {no3_ans}")
no4_ans = 20 * 0.8 + 50 * (1-0.8)
print(f"no4. {no4_ans}")

no1. 34.0
no2. 28.000000000000004
no3. 29.0
no4. 26.0

In [44]:
Session = sessionmaker(bind=engine)
session = Session()

# カーソルを使用したUPDATE操作
def update_book_price():
    # カーソルの作成と使用
    cursor = session.execute(text("SELECT * FROM books WHERE cat_id = 'C01' FOR UPDATE"))
    
    for row in cursor:
        book_id = row.book_id
        current_price = row.price
        new_price = int(current_price * 1.1)  # 10%値上げ
        
        # UPDATEの実行
        session.execute(text("""
        UPDATE books
        SET price = :new_price
        WHERE CURRENT OF cursor
        """).bindparams(new_price=new_price))

    session.commit()

# 更新前のデータ表示
print("更新前:")
result = session.execute(text("SELECT * FROM books"))
for row in result:
    print(row)

# 更新の実行
update_book_price()

# 更新後のデータ表示
print("\n更新後:")
result = session.execute(text("SELECT * FROM books"))
for row in result:
    print(row)

session.close()

In [45]:
# クエリの作成
sql_query = """
(SELECT DISTINCT cat_id FROM books WHERE cat_id IS NOT NULL)
EXCEPT
(SELECT DISTINCT cat_id FROM books WHERE price > 2000 AND cat_id IS NOT NULL)
"""

# クエリを実行
with engine.connect() as connection:
    result = connection.execute(text(sql_query))
    rows = result.fetchall()

print("クエリの実行結果:")
for row in rows:
    print(row[0])

print("\n結果の説明:")
print("このクエリは、booksテーブルに存在するカテゴリーのうち、")
print("価格が2000円を超える本がないカテゴリーを抽出しています。")
print("つまり、すべての本が2000円以下のカテゴリーを特定しています。")
print("\n具体的には:")
for row in rows:
    print(f"- {row[0]}: このカテゴリーの本はすべて2000円以下です")

print("\nこの情報は、例えば価格設定の見直しや、")
print("特定カテゴリーの高額書籍の需要分析などに役立つかもしれません。")

クエリの実行結果:
C05
C02
C03

結果の説明:
このクエリは、booksテーブルに存在するカテゴリーのうち、
価格が2000円を超える本がないカテゴリーを抽出しています。
つまり、すべての本が2000円以下のカテゴリーを特定しています。

具体的には:
- C05: このカテゴリーの本はすべて2000円以下です
- C02: このカテゴリーの本はすべて2000円以下です
- C03: このカテゴリーの本はすべて2000円以下です

この情報は、例えば価格設定の見直しや、
特定カテゴリーの高額書籍の需要分析などに役立つかもしれません。

In [51]:
from tabulate import tabulate

for row in rows:
    q = f'''
    SELECT *
    FROM books
    WHERE cat_id = '{row[0]}'
    '''
    print(f"カテゴリ{row[0]}の2000円以下のDF\n")
    print(tabulate(execute_query_to_dataframe(q, engine)))

カテゴリC05の2000円以下のDF

-  -----  ------------------------  ---  --------  ----------  ---  --
0  B1003  ウォーキングをはじめよう  C05  高橋孝子  2002-09-05  980  15
1  B1006  おてがるレシピ            C05  佐藤茂夫  2012-04-11  880  66
-  -----  ------------------------  ---  --------  ----------  ---  --
カテゴリC02の2000円以下のDF

-  -----  ---------------------  ---  --------  ----------  ----  -
0  B1005  成功する人の108の習慣  C02  高橋太郎  2008-03-03  1500  2
-  -----  ---------------------  ---  --------  ----------  ----  -
カテゴリC03の2000円以下のDF

-  -----  ------------------------------  ---  --------  ----------  ----  --
0  B1007  みきむら先生の基本情報技術教本  C03  三木村健  2016-08-24  1800  32
-  -----  ------------------------------  ---  --------  ----------  ----  --

# データベースの和集合演算（UNION）が成立するための必要十分条件は？
- 条件: 次数が同じで，対応する属性のドメインが等しい。
- 以下のコードがわかりやすかった。

In [52]:
from typing import List, Any

def compare_structures(structure1: List[Any], structure2: List[Any]) -> bool:
    # 次数（要素の数）が同じかチェック
    if len(structure1) != len(structure2):
        return False
    
    # 対応する属性のドメインが等しいかチェック
    for attr1, attr2 in zip(structure1, structure2):
        if type(attr1) != type(attr2):
            return False
    
    return True

# 使用例
structure_a = [1, "hello", 3.14]
structure_b = [5, "world", 2.71]
structure_c = [True, "python", 1]

print(compare_structures(structure_a, structure_b))  # True
print(compare_structures(structure_a, structure_c))  # False

True
False

おっしゃる通りです。VBAの構造は、他の現代的なプログラミング言語と比べると確かに特殊に感じられることがあります。VBAと他の言語との主な違いを説明しましょう。



1. エントリーポイントの違い：
   - 多くの言語： main()関数などの明確なエントリーポイントがある
   - VBA： Form_Load()などのイベントハンドラが実質的なエントリーポイントになる

2. コードの配置：
   - 多くの言語： クラスや関数を明示的に定義し、それらを呼び出す
   - VBA： フォームやモジュールに直接コードを書くことが多い

3. 実行の流れ：
   - 多くの言語： トップダウンの逐次実行が基本
   - VBA： イベントに応じて関数が呼び出される非線形な実行フロー

4. スコープとグローバル変数：
   - 多くの言語： グローバル変数の使用は一般的に避けられる
   - VBA： モジュールレベルの変数（実質的なグローバル変数）の使用が一般的

5. オブジェクト指向の実装：
   - 多くの言語： クラスベースの強力なOOP機能
   - VBA： OOPの概念はサポートされているが、より限定的

以下に、典型的な言語とVBAの構造の違いを簡単な例で示します：

Python の例：
```python
class MyClass:
    def __init__(self):
        self.data = []

    def add_data(self, item):
        self.data.append(item)

def main():
    my_object = MyClass()
    my_object.add_data("Hello")
    print(my_object.data)

if __name__ == "__main__":
    main()
```

VBA の例：
```vba
' モジュールレベルの変数（グローバル変数に相当）
Public myData As New Collection

' フォームのロードイベント（エントリーポイントの役割）
Private Sub Form_Load()
    Call InitializeData
End Sub

' ボタンクリックイベント
Private Sub CommandButton1_Click()
    Call AddData("Hello")
    MsgBox myData(1)
End Sub

' 通常の関数
Private Sub InitializeData()
    Set myData = New Collection
End Sub

Private Sub AddData(item As String)
    myData.Add item
End Sub
```

VBAの構造に慣れるには時間がかかることがありますが、この構造はMicrosoft Officeアプリケーションとの密接な統合を目的として設計されています。イベント駆動型の性質により、ユーザーインターフェースとの連携が容易になっているのが特徴です。

In [56]:
df = execute_query_to_dataframe('SELECT * FROM books', engine)
df.head()

  book_id          title cat_id author        date  price  stock
0   B1001  たのしく学ぶSQLコマンド    C01   鈴木正男  2001-05-03   1800  120.0
1   B1002      はじめてのDB設計    C01   鈴木正子  2001-10-21   2000   88.0
2   B1003   ウォーキングをはじめよう    C05   高橋孝子  2002-09-05    980   15.0
3   B1004     ネットワーク構築入門    C01   山田和夫  2004-08-04   2200   56.0
4   B1005   成功する人の108の習慣    C02   高橋太郎  2008-03-03   1500    2.0

In [57]:
with engine.connect() as connection:
    # ストアドプロシージャの作成
    connection.execute(text("""
    CREATE PROCEDURE IF NOT EXISTS update_books_cursor()
    BEGIN
        DECLARE done INT DEFAULT FALSE;
        DECLARE b_id VARCHAR(10);
        DECLARE cur CURSOR FOR SELECT book_id FROM books WHERE cat_id = 'C01';
        DECLARE CONTINUE HANDLER FOR NOT FOUND SET done = TRUE;
        
        OPEN cur;
        
        read_loop: LOOP
            FETCH cur INTO b_id;
            IF done THEN
                LEAVE read_loop;
            END IF;
            
            UPDATE books SET price = price * 1.1, stock = stock - 5 WHERE book_id = b_id;
        END LOOP;
        
        CLOSE cur;
    END
    """))

    # ストアドプロシージャの実行
    connection.execute(text("CALL update_books_cursor()"))

In [59]:
# TODO おそらくコミットされてないから以下のdfに反映されていない

In [58]:
df = execute_query_to_dataframe('SELECT * FROM books', engine)
df.head()

  book_id          title cat_id author        date  price  stock
0   B1001  たのしく学ぶSQLコマンド    C01   鈴木正男  2001-05-03   1800  120.0
1   B1002      はじめてのDB設計    C01   鈴木正子  2001-10-21   2000   88.0
2   B1003   ウォーキングをはじめよう    C05   高橋孝子  2002-09-05    980   15.0
3   B1004     ネットワーク構築入門    C01   山田和夫  2004-08-04   2200   56.0
4   B1005   成功する人の108の習慣    C02   高橋太郎  2008-03-03   1500    2.0

In [1]:
import pandas as pd

df = pd.DataFrame({"A":[1,2,3,4,5], "B":[6,7,8,9,10]})

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [2]:
# 1行目が3より大きいか大きくないかってことね
df.iloc[1]>3

A    False
B     True
Name: 1, dtype: bool

In [3]:
# 単純に一行目
df.iloc[1]

A    2
B    7
Name: 1, dtype: int64

In [6]:
# (キャッシュメモリのアクセス時間*ヒット率)+(主記憶のアクセス時間*(1-ヒット率))
(10 * 0.6) + 70 * (1 - 0.6)

34.0

はい、その通りです！素晴らしい発想ですね。実際、多くの企業でそのような方法を使ってユーザー管理を自動化しています。では、そのアイデアを具体的なコードで見てみましょう。

まず、社員情報を格納するテーブルを作ります：

```python
from sqlalchemy import create_engine, text, Table, Column, Integer, String, MetaData

engine = create_engine('mysql+mysqlconnector://root:password@localhost/your_database')
metadata = MetaData()

# 社員テーブルの定義
employees = Table('example_employees', metadata,
    Column('employee_id', String(10), primary_key=True),
    Column('organization', String(50)),
    Column('name', String(100))
)

# テーブルの作成
metadata.create_all(engine)

print("社員テーブルを作成しました！")
```

次に、この社員テーブルを使ってユーザーを作成し、権限を付与するスクリプトを作ります：

```python
from sqlalchemy import create_engine, text, select
from sqlalchemy.orm import Session

engine = create_engine('mysql+mysqlconnector://root:password@localhost/your_database')

def create_users_and_grant_permissions():
    with Session(engine) as session:
        # 社員テーブルからデータを取得
        result = session.execute(select(employees))
        employees_data = result.fetchall()

        for employee in employees_data:
            employee_id, organization, name = employee

            # ユーザー名を作成 (社員番号 + 組織)
            username = f"{employee_id}_{organization}"

            # ユーザーを作成
            create_user_query = text("""
            CREATE USER IF NOT EXISTS :username@'localhost' IDENTIFIED BY :password
            """)
            session.execute(create_user_query, {
                'username': username,
                'password': 'TempPass123!'  # 実際には強力で一意のパスワードを使用すべきです
            })

            # SELECTのみの権限を付与
            grant_query = text("""
            GRANT SELECT ON example_music_tracks TO :username@'localhost'
            """)
            session.execute(grant_query, {'username': username})

        # 変更を保存
        session.commit()

    print("ユーザーの作成と権限の付与が完了しました！")

# 関数を実行
create_users_and_grant_permissions()
```

このスクリプトでは：

1. 社員テーブルからすべての社員データを取得します。
2. 各社員に対して、社員番号と組織を組み合わせてユーザー名を作ります。
3. そのユーザー名でMySQLユーザーを作成します。
4. 作成したユーザーに`example_music_tracks`テーブルのSELECT権限を付与します。

注意点：
- パスワードの扱いには十分注意が必要です。上記の例では簡単のため固定のパスワードを使っていますが、実際の運用では各ユーザーに一意で強力なパスワードを設定し、安全に管理する必要があります。
- 大量のユーザーを一度に作成する場合、データベースへの負荷を考慮する必要があります。必要に応じてバッチ処理を検討しましょう。
- ユーザー作成と権限付与は重要な操作なので、ログを取るなどして、誰がいつどのような操作を行ったかを記録することが推奨されます。

このアプローチを使えば、社員の入退社や組織変更があった場合も、社員テーブルを更新するだけで、データベースのユーザー管理を自動的に行うことができます。これにより、大規模な組織でも効率的かつ一貫性のあるユーザー管理が可能になります。

もちろんです。Oracleのプロシージャを使って同様の処理を行う方法を説明します。Oracleでは、PL/SQLという言語を使ってプロシージャを作成します。以下に、社員テーブルからユーザーを作成し、権限を付与するプロシージャの例を示します。

まず、社員テーブルを作成します：

```sql
CREATE TABLE example_employees (
    employee_id VARCHAR2(10) PRIMARY KEY,
    organization VARCHAR2(50),
    name VARCHAR2(100)
);
```

次に、ユーザー作成と権限付与を行うプロシージャを作成します：

```sql
CREATE OR REPLACE PROCEDURE create_users_and_grant_permissions AS
    -- カーソルを定義して社員データを取得
    CURSOR emp_cursor IS
        SELECT employee_id, organization
        FROM example_employees;
    
    v_username VARCHAR2(100);
    v_sql VARCHAR2(1000);
BEGIN
    -- カーソルをループして各社員に対して処理を行う
    FOR emp_rec IN emp_cursor LOOP
        -- ユーザー名を作成 (社員番号 + 組織)
        v_username := emp_rec.employee_id || '_' || emp_rec.organization;
        
        -- ユーザーを作成
        BEGIN
            v_sql := 'CREATE USER ' || v_username || ' IDENTIFIED BY TempPass123!';
            EXECUTE IMMEDIATE v_sql;
        EXCEPTION
            WHEN OTHERS THEN
                IF SQLCODE != -1920 THEN  -- ORA-01920: user name 'string' conflicts with another user or role name
                    RAISE;
                END IF;
        END;
        
        -- SELECTのみの権限を付与
        v_sql := 'GRANT SELECT ON example_music_tracks TO ' || v_username;
        EXECUTE IMMEDIATE v_sql;
        
        -- 接続権限を付与（Oracleではこれが必要）
        v_sql := 'GRANT CREATE SESSION TO ' || v_username;
        EXECUTE IMMEDIATE v_sql;
        
        DBMS_OUTPUT.PUT_LINE('ユーザー ' || v_username || ' を作成し、権限を付与しました。');
    END LOOP;
    
    COMMIT;
    DBMS_OUTPUT.PUT_LINE('全てのユーザー作成と権限付与が完了しました。');
EXCEPTION
    WHEN OTHERS THEN
        DBMS_OUTPUT.PUT_LINE('エラーが発生しました: ' || SQLERRM);
        ROLLBACK;
        RAISE;
END create_users_and_grant_permissions;
/
```

このプロシージャでは：

1. `emp_cursor`を使って社員テーブルからデータを取得します。
2. カーソルをループして各社員に対して処理を行います。
3. 社員番号と組織を組み合わせてユーザー名を作成します。
4. そのユーザー名でOracleユーザーを作成します。
5. 作成したユーザーに`example_music_tracks`テーブルのSELECT権限を付与します。
6. Oracleでは接続権限（CREATE SESSION）も必要なので、それも付与します。

プロシージャを実行するには：

```sql
BEGIN
    create_users_and_grant_permissions;
END;
/
```

注意点：
- このプロシージャを実行するには、ユーザー作成や権限付与の権限を持つ高権限ユーザー（例：SYSDBA）で接続する必要があります。
- パスワードの扱いには十分注意してください。実際の運用では、より安全な方法でパスワードを管理する必要があります。
- 大量のユーザーを作成する場合、パフォーマンスに影響を与える可能性があります。必要に応じてバッチ処理を検討してください。
- エラーハンドリングを含めていますが、実際の運用ではより詳細なエラー処理やログ記録が必要かもしれません。

このOracleプロシージャを使用することで、Pythonスクリプトと同様に、社員テーブルの情報に基づいてデータベースユーザーを自動的に管理できます。社員の変更があった場合も、社員テーブルを更新してこのプロシージャを実行するだけで、ユーザー管理を効率的に行うことができます。